<h1><u><center>University Schema Assignment</center></u></h1>

### **DATABASE CREATION AND CONNECTING IT**

In [1]:
import pandas as pd
import sqlite3
connection=sqlite3.connect('university.db')

In [2]:
%load_ext sql
%sql sqlite:///university.db

'Connected: @university.db'

### NOW WE WILL CREATE TABLES AND INSERT DATA

In [3]:
%%sql
create table classroom
	(building		varchar(15),
	 room_number		varchar(7),
	 capacity		numeric(4,0),
	 primary key (building, room_number)
	);

 * sqlite:///university.db
Done.

[]

In [4]:
%%sql
insert into classroom values ('Packard', '101', '500');
insert into classroom values ('Painter', '514', '10');
insert into classroom values ('Taylor', '3128', '70');
insert into classroom values ('Watson', '100', '30');
insert into classroom values ('Watson', '120', '50');
insert into classroom values ('Taylor', '112', '30');
insert into classroom values ('Painter', '234', '50');
insert into classroom values ('Packard', '303', '56')

 * sqlite:///university.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [5]:
%%sql
select * from classroom

 * sqlite:///university.db
Done.

[('Packard', '101', 500),
 ('Painter', '514', 10),
 ('Taylor', '3128', 70),
 ('Watson', '100', 30),
 ('Watson', '120', 50),
 ('Taylor', '112', 30),
 ('Painter', '234', 50),
 ('Packard', '303', 56)]

In [6]:
%%sql
create table department
	(dept_name		varchar(20), 
	 building		varchar(15), 
	 budget		        numeric(12,2) check (budget > 0),
	 primary key (dept_name)
	);

 * sqlite:///university.db
Done.

[]

In [7]:
%%sql
insert into department values ('Biology', 'Watson', '90000');
insert into department values ('Comp. Sci.', 'Taylor', '100000');
insert into department values ('Elec. Eng.', 'Taylor', '85000');
insert into department values ('Finance', 'Painter', '120000');
insert into department values ('History', 'Painter', '50000');
insert into department values ('Music', 'Packard', '80000');
insert into department values ('Physics', 'Watson', '70000');

 * sqlite:///university.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [8]:
%%sql
select * from department

 * sqlite:///university.db
Done.

[('Biology', 'Watson', 90000),
 ('Comp. Sci.', 'Taylor', 100000),
 ('Elec. Eng.', 'Taylor', 85000),
 ('Finance', 'Painter', 120000),
 ('History', 'Painter', 50000),
 ('Music', 'Packard', 80000),
 ('Physics', 'Watson', 70000)]

In [9]:
%%sql
create table course
	(course_id		varchar(8), 
	 title			varchar(50), 
	 dept_name		varchar(20),
	 credits		numeric(2,0) check (credits > 0),
	 primary key (course_id),
	 foreign key (dept_name) references department (dept_name)
		on delete set null
	);

 * sqlite:///university.db
Done.

[]

In [10]:
%%sql

insert into course values ('BIO-101', 'Intro. to Biology', 'Biology', '4');
insert into course values ('BIO-301', 'Genetics', 'Biology', '4');
insert into course values ('BIO-399', 'Computational Biology', 'Biology', '3');
insert into course values ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', '4');
insert into course values ('CS-190', 'Game Design', 'Comp. Sci.', '4');
insert into course values ('CS-315', 'Robotics', 'Comp. Sci.', '3');
insert into course values ('CS-319', 'Image Processing', 'Comp. Sci.', '3');
insert into course values ('CS-347', 'Database System Concepts', 'Comp. Sci.', '3');
insert into course values ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', '3');
insert into course values ('FIN-201', 'Investment Banking', 'Finance', '3');
insert into course values ('HIS-351', 'World History', 'History', '3');
insert into course values ('MU-199', 'Music Video Production', 'Music', '3');
insert into course values ('PHY-101', 'Physical Principles', 'Physics', '4');

 * sqlite:///university.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [11]:
%%sql
select * from course

 * sqlite:///university.db
Done.

[('BIO-101', 'Intro. to Biology', 'Biology', 4),
 ('BIO-301', 'Genetics', 'Biology', 4),
 ('BIO-399', 'Computational Biology', 'Biology', 3),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', 4),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3),
 ('CS-319', 'Image Processing', 'Comp. Sci.', 3),
 ('CS-347', 'Database System Concepts', 'Comp. Sci.', 3),
 ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', 3),
 ('FIN-201', 'Investment Banking', 'Finance', 3),
 ('HIS-351', 'World History', 'History', 3),
 ('MU-199', 'Music Video Production', 'Music', 3),
 ('PHY-101', 'Physical Principles', 'Physics', 4)]

In [12]:
%%sql
create table instructor
	(ID			varchar(5), 
	 name			varchar(20) not null, 
	 dept_name		varchar(20), 
	 salary			numeric(8,2) check (salary > 29000),
	 primary key (ID),
	 foreign key (dept_name) references department (dept_name)
		on delete set null
	);

 * sqlite:///university.db
Done.

[]

In [13]:
%%sql
insert into instructor values ('10101', 'Srinivasan', 'Comp. Sci.', '65000');
insert into instructor values ('12121', 'Wu', 'Finance', '90000');
insert into instructor values ('15151', 'Mozart', 'Music', '40000');
insert into instructor values ('22222', 'Einstein', 'Physics', '95000');
insert into instructor values ('32343', 'El Said', 'History', '60000');
insert into instructor values ('33456', 'Gold', 'Physics', '87000');
insert into instructor values ('45565', 'Katz', 'Comp. Sci.', '75000');
insert into instructor values ('58583', 'Califieri', 'History', '62000');
insert into instructor values ('76543', 'Singh', 'Finance', '80000');
insert into instructor values ('76766', 'Crick', 'Biology', '72000');
insert into instructor values ('83821', 'Brandt', 'Comp. Sci.', '92000');
insert into instructor values ('98345', 'Kim', 'Elec. Eng.', '80000');

 * sqlite:///university.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [14]:
%%sql
select * from instructor

 * sqlite:///university.db
Done.

[('10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('12121', 'Wu', 'Finance', 90000),
 ('15151', 'Mozart', 'Music', 40000),
 ('22222', 'Einstein', 'Physics', 95000),
 ('32343', 'El Said', 'History', 60000),
 ('33456', 'Gold', 'Physics', 87000),
 ('45565', 'Katz', 'Comp. Sci.', 75000),
 ('58583', 'Califieri', 'History', 62000),
 ('76543', 'Singh', 'Finance', 80000),
 ('76766', 'Crick', 'Biology', 72000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000),
 ('98345', 'Kim', 'Elec. Eng.', 80000)]

In [15]:
%%sql
create table section
	(course_id		varchar(8), 
         sec_id			varchar(8),
	 semester		varchar(6)
		check (semester in ('Fall', 'Winter', 'Spring', 'Summer')), 
	 year			numeric(4,0) check (year > 1701 and year < 2100), 
	 building		varchar(15),
	 room_number		varchar(7),
	 time_slot_id		varchar(4),
	 primary key (course_id, sec_id, semester, year),
	 foreign key (course_id) references course (course_id)
		on delete cascade,
	 foreign key (building, room_number) references classroom (building, room_number)
		on delete set null
	);

 * sqlite:///university.db
Done.

[]

In [16]:
%%sql
insert into section values ('BIO-101', '1', 'Summer', '2017', 'Painter', '514', 'B');
insert into section values ('BIO-301', '1', 'Summer', '2018', 'Painter', '514', 'A');
insert into section values ('CS-101', '1', 'Fall', '2017', 'Packard', '101', 'H');
insert into section values ('CS-101', '1', 'Spring', '2018', 'Packard', '101', 'F');
insert into section values ('CS-190', '1', 'Spring', '2017', 'Taylor', '3128', 'E');
insert into section values ('CS-190', '2', 'Spring', '2017', 'Taylor', '3128', 'A');
insert into section values ('CS-315', '1', 'Spring', '2018', 'Watson', '120', 'D');
insert into section values ('CS-319', '1', 'Spring', '2018', 'Watson', '100', 'B');
insert into section values ('CS-319', '2', 'Spring', '2018', 'Taylor', '3128', 'C');
insert into section values ('CS-347', '1', 'Fall', '2017', 'Taylor', '3128', 'A');
insert into section values ('EE-181', '1', 'Spring', '2017', 'Taylor', '3128', 'C');
insert into section values ('FIN-201', '1', 'Spring', '2018', 'Packard', '101', 'B');
insert into section values ('HIS-351', '1', 'Spring', '2018', 'Painter', '514', 'C');
insert into section values ('MU-199', '1', 'Spring', '2018', 'Packard', '101', 'D');
insert into section values ('PHY-101', '1', 'Fall', '2017', 'Watson', '100', 'A');

 * sqlite:///university.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [17]:
%%sql
select * from section

 * sqlite:///university.db
Done.

[('BIO-101', '1', 'Summer', 2017, 'Painter', '514', 'B'),
 ('BIO-301', '1', 'Summer', 2018, 'Painter', '514', 'A'),
 ('CS-101', '1', 'Fall', 2017, 'Packard', '101', 'H'),
 ('CS-101', '1', 'Spring', 2018, 'Packard', '101', 'F'),
 ('CS-190', '1', 'Spring', 2017, 'Taylor', '3128', 'E'),
 ('CS-190', '2', 'Spring', 2017, 'Taylor', '3128', 'A'),
 ('CS-315', '1', 'Spring', 2018, 'Watson', '120', 'D'),
 ('CS-319', '1', 'Spring', 2018, 'Watson', '100', 'B'),
 ('CS-319', '2', 'Spring', 2018, 'Taylor', '3128', 'C'),
 ('CS-347', '1', 'Fall', 2017, 'Taylor', '3128', 'A'),
 ('EE-181', '1', 'Spring', 2017, 'Taylor', '3128', 'C'),
 ('FIN-201', '1', 'Spring', 2018, 'Packard', '101', 'B'),
 ('HIS-351', '1', 'Spring', 2018, 'Painter', '514', 'C'),
 ('MU-199', '1', 'Spring', 2018, 'Packard', '101', 'D'),
 ('PHY-101', '1', 'Fall', 2017, 'Watson', '100', 'A')]

In [18]:
%%sql
create table teaches
	(ID			varchar(5), 
	 course_id		varchar(8),
	 sec_id			varchar(8), 
	 semester		varchar(6),
	 year			numeric(4,0),
	 primary key (ID, course_id, sec_id, semester, year),
	 foreign key (course_id, sec_id, semester, year) references section (course_id, sec_id, semester, year)
		on delete cascade,
	 foreign key (ID) references instructor (ID)
		on delete cascade
	);

 * sqlite:///university.db
Done.

[]

In [19]:
%%sql
insert into teaches values ('10101', 'CS-101', '1', 'Fall', '2017');
insert into teaches values ('10101', 'CS-315', '1', 'Spring', '2018');
insert into teaches values ('10101', 'CS-347', '1', 'Fall', '2017');
insert into teaches values ('12121', 'FIN-201', '1', 'Spring', '2018');
insert into teaches values ('15151', 'MU-199', '1', 'Spring', '2018');
insert into teaches values ('22222', 'PHY-101', '1', 'Fall', '2017');
insert into teaches values ('32343', 'HIS-351', '1', 'Spring', '2018');
insert into teaches values ('45565', 'CS-101', '1', 'Spring', '2018');
insert into teaches values ('45565', 'CS-319', '1', 'Spring', '2018');
insert into teaches values ('76766', 'BIO-101', '1', 'Summer', '2017');
insert into teaches values ('76766', 'BIO-301', '1', 'Summer', '2018');
insert into teaches values ('83821', 'CS-190', '1', 'Spring', '2017');
insert into teaches values ('83821', 'CS-190', '2', 'Spring', '2017');
insert into teaches values ('83821', 'CS-319', '2', 'Spring', '2018');
insert into teaches values ('98345', 'EE-181', '1', 'Spring', '2017');

 * sqlite:///university.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [20]:
%%sql
select * from teaches

 * sqlite:///university.db
Done.

[('10101', 'CS-101', '1', 'Fall', 2017),
 ('10101', 'CS-315', '1', 'Spring', 2018),
 ('10101', 'CS-347', '1', 'Fall', 2017),
 ('12121', 'FIN-201', '1', 'Spring', 2018),
 ('15151', 'MU-199', '1', 'Spring', 2018),
 ('22222', 'PHY-101', '1', 'Fall', 2017),
 ('32343', 'HIS-351', '1', 'Spring', 2018),
 ('45565', 'CS-101', '1', 'Spring', 2018),
 ('45565', 'CS-319', '1', 'Spring', 2018),
 ('76766', 'BIO-101', '1', 'Summer', 2017),
 ('76766', 'BIO-301', '1', 'Summer', 2018),
 ('83821', 'CS-190', '1', 'Spring', 2017),
 ('83821', 'CS-190', '2', 'Spring', 2017),
 ('83821', 'CS-319', '2', 'Spring', 2018),
 ('98345', 'EE-181', '1', 'Spring', 2017)]

In [21]:
%%sql
create table student
	(ID			varchar(5), 
	 name			varchar(20) not null, 
	 dept_name		varchar(20), 
	 tot_cred		numeric(3,0) check (tot_cred >= 0),
	 primary key (ID),
	 foreign key (dept_name) references department (dept_name)
		on delete set null
	);

 * sqlite:///university.db
Done.

[]

In [22]:
%%sql

insert into student values ('00128', 'Zhang', 'Comp. Sci.', '102');
insert into student values ('12345', 'Shankar', 'Comp. Sci.', '32');
insert into student values ('19991', 'Brandt', 'History', '80');
insert into student values ('23121', 'Chavez', 'Finance', '110');
insert into student values ('44553', 'Peltier', 'Physics', '56');
insert into student values ('45678', 'Levy', 'Physics', '46');
insert into student values ('54321', 'Williams', 'Comp. Sci.', '54');
insert into student values ('55739', 'Sanchez', 'Music', '38');
insert into student values ('70557', 'Snow', 'Physics', '0');
insert into student values ('76543', 'Brown', 'Comp. Sci.', '58');
insert into student values ('76653', 'Aoi', 'Elec. Eng.', '60');
insert into student values ('98765', 'Bourikas', 'Elec. Eng.', '98');
insert into student values ('98988', 'Tanaka', 'Biology', '120');

 * sqlite:///university.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [23]:
%%sql
select * from student

 * sqlite:///university.db
Done.

[('00128', 'Zhang', 'Comp. Sci.', 102),
 ('12345', 'Shankar', 'Comp. Sci.', 32),
 ('19991', 'Brandt', 'History', 80),
 ('23121', 'Chavez', 'Finance', 110),
 ('44553', 'Peltier', 'Physics', 56),
 ('45678', 'Levy', 'Physics', 46),
 ('54321', 'Williams', 'Comp. Sci.', 54),
 ('55739', 'Sanchez', 'Music', 38),
 ('70557', 'Snow', 'Physics', 0),
 ('76543', 'Brown', 'Comp. Sci.', 58),
 ('76653', 'Aoi', 'Elec. Eng.', 60),
 ('98765', 'Bourikas', 'Elec. Eng.', 98),
 ('98988', 'Tanaka', 'Biology', 120)]

In [24]:
%%sql
create table takes
	(ID			varchar(5), 
	 course_id		varchar(8),
	 sec_id			varchar(8), 
	 semester		varchar(6),
	 year			numeric(4,0),
	 grade		        varchar(2),
	 primary key (ID, course_id, sec_id, semester, year),
	 foreign key (course_id, sec_id, semester, year) references section (course_id, sec_id, semester, year)
		on delete cascade,
	 foreign key (ID) references student (ID)
		on delete cascade
	);

 * sqlite:///university.db
Done.

[]

In [25]:
%%sql
insert into takes values ('00128', 'CS-101', '1', 'Fall', '2017', 'A');
insert into takes values ('00128', 'CS-347', '1', 'Fall', '2017', 'A-');
insert into takes values ('12345', 'CS-101', '1', 'Fall', '2017', 'C');
insert into takes values ('12345', 'CS-190', '2', 'Spring', '2017', 'A');
insert into takes values ('12345', 'CS-315', '1', 'Spring', '2018', 'A');
insert into takes values ('12345', 'CS-347', '1', 'Fall', '2017', 'A');
insert into takes values ('19991', 'HIS-351', '1', 'Spring', '2018', 'B');
insert into takes values ('23121', 'FIN-201', '1', 'Spring', '2018', 'C+');
insert into takes values ('44553', 'PHY-101', '1', 'Fall', '2017', 'B-');
insert into takes values ('45678', 'CS-101', '1', 'Fall', '2017', 'F');
insert into takes values ('45678', 'CS-101', '1', 'Spring', '2018', 'B+');
insert into takes values ('45678', 'CS-319', '1', 'Spring', '2018', 'B');
insert into takes values ('54321', 'CS-101', '1', 'Fall', '2017', 'A-');
insert into takes values ('54321', 'CS-190', '2', 'Spring', '2017', 'B+');
insert into takes values ('55739', 'MU-199', '1', 'Spring', '2018', 'A-');
insert into takes values ('76543', 'CS-101', '1', 'Fall', '2017', 'A');
insert into takes values ('76543', 'CS-319', '2', 'Spring', '2018', 'A');
insert into takes values ('76653', 'EE-181', '1', 'Spring', '2017', 'C');
insert into takes values ('98765', 'CS-101', '1', 'Fall', '2017', 'C-');
insert into takes values ('98765', 'CS-315', '1', 'Spring', '2018', 'B');
insert into takes values ('98988', 'BIO-101', '1', 'Summer', '2017', 'A');
insert into takes values ('98988', 'BIO-301', '1', 'Summer', '2018', null);

 * sqlite:///university.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [26]:
%%sql
select * from takes

 * sqlite:///university.db
Done.

[('00128', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('00128', 'CS-347', '1', 'Fall', 2017, 'A-'),
 ('12345', 'CS-101', '1', 'Fall', 2017, 'C'),
 ('12345', 'CS-190', '2', 'Spring', 2017, 'A'),
 ('12345', 'CS-315', '1', 'Spring', 2018, 'A'),
 ('12345', 'CS-347', '1', 'Fall', 2017, 'A'),
 ('19991', 'HIS-351', '1', 'Spring', 2018, 'B'),
 ('23121', 'FIN-201', '1', 'Spring', 2018, 'C+'),
 ('44553', 'PHY-101', '1', 'Fall', 2017, 'B-'),
 ('45678', 'CS-101', '1', 'Fall', 2017, 'F'),
 ('45678', 'CS-101', '1', 'Spring', 2018, 'B+'),
 ('45678', 'CS-319', '1', 'Spring', 2018, 'B'),
 ('54321', 'CS-101', '1', 'Fall', 2017, 'A-'),
 ('54321', 'CS-190', '2', 'Spring', 2017, 'B+'),
 ('55739', 'MU-199', '1', 'Spring', 2018, 'A-'),
 ('76543', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('76543', 'CS-319', '2', 'Spring', 2018, 'A'),
 ('76653', 'EE-181', '1', 'Spring', 2017, 'C'),
 ('98765', 'CS-101', '1', 'Fall', 2017, 'C-'),
 ('98765', 'CS-315', '1', 'Spring', 2018, 'B'),
 ('98988', 'BIO-101', '1', 'Summer', 2017, 'A'),
 ('98988', 'BIO-301', '1', 'Summer', 2018, None)]

In [27]:
%%sql
create table advisor
	(s_ID			varchar(5),
	 i_ID			varchar(5),
	 primary key (s_ID),
	 foreign key (i_ID) references instructor (ID)
		on delete set null,
	 foreign key (s_ID) references student (ID)
		on delete cascade
	);

 * sqlite:///university.db
Done.

[]

In [28]:
%%sql
insert into advisor values ('00128', '45565');
insert into advisor values ('12345', '10101');
insert into advisor values ('23121', '76543');
insert into advisor values ('44553', '22222');
insert into advisor values ('45678', '22222');
insert into advisor values ('76543', '45565');
insert into advisor values ('76653', '98345');
insert into advisor values ('98765', '98345');
insert into advisor values ('98988', '76766');

 * sqlite:///university.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [29]:
%%sql
select * from advisor

 * sqlite:///university.db
Done.

[('00128', '45565'),
 ('12345', '10101'),
 ('23121', '76543'),
 ('44553', '22222'),
 ('45678', '22222'),
 ('76543', '45565'),
 ('76653', '98345'),
 ('98765', '98345'),
 ('98988', '76766')]

In [30]:
%%sql
create table time_slot
	(time_slot_id		varchar(4),
	 day			varchar(1),
	 start_hr		numeric(2) check (start_hr >= 0 and start_hr < 24),
	 start_min		numeric(2) check (start_min >= 0 and start_min < 60),
	 end_hr			numeric(2) check (end_hr >= 0 and end_hr < 24),
	 end_min		numeric(2) check (end_min >= 0 and end_min < 60),
	 primary key (time_slot_id, day, start_hr, start_min)
	);

 * sqlite:///university.db
Done.

[]

In [31]:
%%sql
insert into time_slot values ('A', 'M', '8', '0', '8', '50');
insert into time_slot values ('A', 'W', '8', '0', '8', '50');
insert into time_slot values ('A', 'F', '8', '0', '8', '50');
insert into time_slot values ('B', 'M', '9', '0', '9', '50');
insert into time_slot values ('B', 'W', '9', '0', '9', '50');
insert into time_slot values ('B', 'F', '9', '0', '9', '50');
insert into time_slot values ('C', 'M', '11', '0', '11', '50');
insert into time_slot values ('C', 'W', '11', '0', '11', '50');
insert into time_slot values ('C', 'F', '11', '0', '11', '50');
insert into time_slot values ('D', 'M', '13', '0', '13', '50');
insert into time_slot values ('D', 'W', '13', '0', '13', '50');
insert into time_slot values ('D', 'F', '13', '0', '13', '50');
insert into time_slot values ('E', 'T', '10', '30', '11', '45 ');
insert into time_slot values ('E', 'R', '10', '30', '11', '45 ');
insert into time_slot values ('F', 'T', '14', '30', '15', '45 ');
insert into time_slot values ('F', 'R', '14', '30', '15', '45 ');
insert into time_slot values ('G', 'M', '16', '0', '16', '50');
insert into time_slot values ('G', 'W', '16', '0', '16', '50');
insert into time_slot values ('G', 'F', '16', '0', '16', '50');
insert into time_slot values ('H', 'W', '10', '0', '12', '30');

 * sqlite:///university.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [32]:
%%sql
select * from time_slot

 * sqlite:///university.db
Done.

[('A', 'M', 8, 0, 8, 50),
 ('A', 'W', 8, 0, 8, 50),
 ('A', 'F', 8, 0, 8, 50),
 ('B', 'M', 9, 0, 9, 50),
 ('B', 'W', 9, 0, 9, 50),
 ('B', 'F', 9, 0, 9, 50),
 ('C', 'M', 11, 0, 11, 50),
 ('C', 'W', 11, 0, 11, 50),
 ('C', 'F', 11, 0, 11, 50),
 ('D', 'M', 13, 0, 13, 50),
 ('D', 'W', 13, 0, 13, 50),
 ('D', 'F', 13, 0, 13, 50),
 ('E', 'T', 10, 30, 11, 45),
 ('E', 'R', 10, 30, 11, 45),
 ('F', 'T', 14, 30, 15, 45),
 ('F', 'R', 14, 30, 15, 45),
 ('G', 'M', 16, 0, 16, 50),
 ('G', 'W', 16, 0, 16, 50),
 ('G', 'F', 16, 0, 16, 50),
 ('H', 'W', 10, 0, 12, 30)]

In [33]:
%%sql
create table prereq
	(course_id		varchar(8), 
	 prereq_id		varchar(8),
	 primary key (course_id, prereq_id),
	 foreign key (course_id) references course (course_id)
		on delete cascade,
	 foreign key (prereq_id) references course (course_id)
	);

 * sqlite:///university.db
Done.

[]

In [34]:
%%sql
insert into prereq values ('BIO-301', 'BIO-101');
insert into prereq values ('BIO-399', 'BIO-101');
insert into prereq values ('CS-190', 'CS-101');
insert into prereq values ('CS-315', 'CS-101');
insert into prereq values ('CS-319', 'CS-101');
insert into prereq values ('CS-347', 'CS-101');
insert into prereq values ('EE-181', 'PHY-101');

 * sqlite:///university.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [35]:
%%sql
select * from prereq

 * sqlite:///university.db
Done.

[('BIO-301', 'BIO-101'),
 ('BIO-399', 'BIO-101'),
 ('CS-190', 'CS-101'),
 ('CS-315', 'CS-101'),
 ('CS-319', 'CS-101'),
 ('CS-347', 'CS-101'),
 ('EE-181', 'PHY-101')]

## **NOW LETS BEGIN WITH THE QUERIES**

### 1. Display average salary given by each department.

In [36]:
%%sql
SELECT dept_name, avg(salary) AS 'AVG SALARY' from instructor
group by dept_name

 * sqlite:///university.db
Done.

[('Biology', 72000.0),
 ('Comp. Sci.', 77333.33333333333),
 ('Elec. Eng.', 80000.0),
 ('Finance', 85000.0),
 ('History', 61000.0),
 ('Music', 40000.0),
 ('Physics', 91000.0)]

### 2. Display the name of students and their corresponding course IDs.

In [37]:
%%sql
Select student.name,takes.course_id from student
  inner join takes on takes.id=student.id;

 * sqlite:///university.db
Done.

[('Zhang', 'CS-101'),
 ('Zhang', 'CS-347'),
 ('Shankar', 'CS-101'),
 ('Shankar', 'CS-190'),
 ('Shankar', 'CS-315'),
 ('Shankar', 'CS-347'),
 ('Brandt', 'HIS-351'),
 ('Chavez', 'FIN-201'),
 ('Peltier', 'PHY-101'),
 ('Levy', 'CS-101'),
 ('Levy', 'CS-101'),
 ('Levy', 'CS-319'),
 ('Williams', 'CS-101'),
 ('Williams', 'CS-190'),
 ('Sanchez', 'MU-199'),
 ('Brown', 'CS-101'),
 ('Brown', 'CS-319'),
 ('Aoi', 'EE-181'),
 ('Bourikas', 'CS-101'),
 ('Bourikas', 'CS-315'),
 ('Tanaka', 'BIO-101'),
 ('Tanaka', 'BIO-301')]

###3. Display number of courses taken by each student.

In [38]:
%%sql
Select student.name,COUNT(takes.course_id) AS 'number of courses' from student
  inner join takes on takes.id=student.id
  GROUP BY TAKES.ID;

 * sqlite:///university.db
Done.

[('Zhang', 2),
 ('Shankar', 4),
 ('Brandt', 1),
 ('Chavez', 1),
 ('Peltier', 1),
 ('Levy', 3),
 ('Williams', 2),
 ('Sanchez', 1),
 ('Brown', 2),
 ('Aoi', 1),
 ('Bourikas', 2),
 ('Tanaka', 2)]

### 4. Get the prerequisites courses for courses in the Spring semester.

In [39]:
%%sql
SELECT tk.semester,tk.course_id,prereq.prereq_id 
  from takes tk
  inner join prereq on prereq.course_id=tk.course_id
where tk.semester='Spring';

 * sqlite:///university.db
Done.

[('Spring', 'CS-190', 'CS-101'),
 ('Spring', 'CS-315', 'CS-101'),
 ('Spring', 'CS-319', 'CS-101'),
 ('Spring', 'CS-190', 'CS-101'),
 ('Spring', 'CS-319', 'CS-101'),
 ('Spring', 'EE-181', 'PHY-101'),
 ('Spring', 'CS-315', 'CS-101')]

### 5. Display the instructor name who teaches student with highest 5 credits.

In [40]:
%%sql
SELECT student.name as "student name",instructor.name as 'instructor name',student.tot_cred 
  from student 
  inner join instructor on instructor.dept_name=student.dept_name
order by student.tot_cred DESC
limit 5;

 * sqlite:///university.db
Done.

[('Tanaka', 'Crick', 120),
 ('Chavez', 'Singh', 110),
 ('Chavez', 'Wu', 110),
 ('Zhang', 'Brandt', 102),
 ('Zhang', 'Katz', 102)]

### 6. Which semester and department offers maximum number of courses.

In [41]:
%%sql
SELECT semester,dept_name, count(section.course_id) as 'number of courses' 
from section,department
where department.building=section.building

group by semester
order by count(course_id)DESC
LIMIT 1;

 * sqlite:///university.db
Done.

[('Spring', 'Music', 17)]

### 7. Display course and department whose time starts at 8.

In [42]:
%%sql
SELECT section.course_id, time_slot.start_hr from section
  inner join time_slot on time_slot.time_slot_id=section.time_slot_id
where start_hr = 8
group by section.course_id;

 * sqlite:///university.db
Done.

[('BIO-301', 8), ('CS-190', 8), ('CS-347', 8), ('PHY-101', 8)]

### 8. Display the salary of instructors from Watson building.

In [43]:
%%sql
SELECT name,salary,instructor.dept_name from instructor
  inner join department on department.dept_name=instructor.dept_name
where department.building='Watson';

 * sqlite:///university.db
Done.

[('Einstein', 95000, 'Physics'),
 ('Gold', 87000, 'Physics'),
 ('Crick', 72000, 'Biology')]

### 9. Show the title of courses available on Monday.

In [44]:
%%sql
select course.title,time_slot.day from course
  inner join section on course.course_id=section.course_id
  inner join time_slot on time_slot.time_slot_id=section.time_slot_id
where time_slot.day='M';

 * sqlite:///university.db
Done.

[('Intro. to Biology', 'M'),
 ('Genetics', 'M'),
 ('Game Design', 'M'),
 ('Robotics', 'M'),
 ('Image Processing', 'M'),
 ('Image Processing', 'M'),
 ('Database System Concepts', 'M'),
 ('Intro. to Digital Systems', 'M'),
 ('Investment Banking', 'M'),
 ('World History', 'M'),
 ('Music Video Production', 'M'),
 ('Physical Principles', 'M')]

### 10. Find the number of courses that start at 8 and end at 8.

In [45]:
%%sql
select start_hr,end_hr, count(section.course_id) as 'number of courses' from time_slot
  inner join section on time_slot.time_slot_id=section.time_slot_id
where start_hr=8 and end_hr=8;

 * sqlite:///university.db
Done.

[(8, 8, 12)]

### 11. Find instructors having salary more than 90000.

In [46]:
%%sql
select name from instructor
where salary>90000;

 * sqlite:///university.db
Done.

[('Einstein',), ('Brandt',)]

### 12. Find student records taking courses before 2018.

In [47]:
%%sql
select * from takes
where year<2018;

 * sqlite:///university.db
Done.

[('00128', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('00128', 'CS-347', '1', 'Fall', 2017, 'A-'),
 ('12345', 'CS-101', '1', 'Fall', 2017, 'C'),
 ('12345', 'CS-190', '2', 'Spring', 2017, 'A'),
 ('12345', 'CS-347', '1', 'Fall', 2017, 'A'),
 ('44553', 'PHY-101', '1', 'Fall', 2017, 'B-'),
 ('45678', 'CS-101', '1', 'Fall', 2017, 'F'),
 ('54321', 'CS-101', '1', 'Fall', 2017, 'A-'),
 ('54321', 'CS-190', '2', 'Spring', 2017, 'B+'),
 ('76543', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('76653', 'EE-181', '1', 'Spring', 2017, 'C'),
 ('98765', 'CS-101', '1', 'Fall', 2017, 'C-'),
 ('98988', 'BIO-101', '1', 'Summer', 2017, 'A')]

### 13. Find student records taking courses in the fall semester and coming under first section.

In [48]:
%%sql
select * from takes
where semester='Fall' and sec_id=1;

 * sqlite:///university.db
Done.

[('00128', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('00128', 'CS-347', '1', 'Fall', 2017, 'A-'),
 ('12345', 'CS-101', '1', 'Fall', 2017, 'C'),
 ('12345', 'CS-347', '1', 'Fall', 2017, 'A'),
 ('44553', 'PHY-101', '1', 'Fall', 2017, 'B-'),
 ('45678', 'CS-101', '1', 'Fall', 2017, 'F'),
 ('54321', 'CS-101', '1', 'Fall', 2017, 'A-'),
 ('76543', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('98765', 'CS-101', '1', 'Fall', 2017, 'C-')]

### 14. Find student records taking courses in the fall semester and coming under second section.

In [49]:
%%sql
select * from takes
where semester='Fall' and sec_id=2;

 * sqlite:///university.db
Done.

[]

In [50]:
%%sql
select * from takes 
where semester='Summer' and sec_id=1 and year=2017;

 * sqlite:///university.db
Done.

[('98988', 'BIO-101', '1', 'Summer', 2017, 'A')]

### 16. Find student records taking courses in the fall semester and having A grade.

In [51]:
%%sql
select * from takes 
where semester='Fall' and grade='A';

 * sqlite:///university.db
Done.

[('00128', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('12345', 'CS-347', '1', 'Fall', 2017, 'A'),
 ('76543', 'CS-101', '1', 'Fall', 2017, 'A')]

### 17. Find student records taking courses in the summer semester and having A grade.

In [52]:
%%sql
select * from takes 
where semester='Summer' and grade='A';

 * sqlite:///university.db
Done.

[('98988', 'BIO-101', '1', 'Summer', 2017, 'A')]

### 18. Display section details with B time slot, room number 514 and in the Painter building.

In [53]:
%%sql
select * from section 
where time_slot_id='B' and room_number=514 and building='Painter';

 * sqlite:///university.db
Done.

[('BIO-101', '1', 'Summer', 2017, 'Painter', '514', 'B')]

### 19. Find all course titles which have a string "Intro.".

In [54]:
%%sql
select title from course
where title like 'Intro%';

 * sqlite:///university.db
Done.

[('Intro. to Biology',),
 ('Intro. to Computer Science',),
 ('Intro. to Digital Systems',)]

### 20. Find the titles of courses in the Computer Science department that have 3 credits.

In [55]:
%%sql
select title from course
where dept_name like 'comp%' and credits=3;

 * sqlite:///university.db
Done.

[('Robotics',), ('Image Processing',), ('Database System Concepts',)]

### 21. Find IDs and titles of all the courses which were taught by an instructor named Einstein. Make sure there are no duplicates in the result.

In [56]:
%%sql
select course_id,title from course
  inner join instructor on instructor.dept_name=course.dept_name
where instructor.name like 'Ein%'

 * sqlite:///university.db
Done.

[('PHY-101', 'Physical Principles')]

### 22. Find all course IDs which start with CS

In [57]:
%%sql
select course_id from course
where course_id like 'CS%';

 * sqlite:///university.db
Done.

[('CS-101',), ('CS-190',), ('CS-315',), ('CS-319',), ('CS-347',)]

### 23. For each department, find the maximum salary of instructors in that department.

In [58]:
%%sql
select dept_name,max(salary) as 'Maximum Salary' from instructor
group by dept_name;

 * sqlite:///university.db
Done.

[('Biology', 72000),
 ('Comp. Sci.', 92000),
 ('Elec. Eng.', 80000),
 ('Finance', 90000),
 ('History', 62000),
 ('Music', 40000),
 ('Physics', 95000)]

### 24. Find the enrollment (number of students) of each section that was offered in Fall 2017.

In [59]:
%%sql
select sec_id,count(id) as 'number of students', semester, year 
from takes
where year=2017 and semester='Fall';

 * sqlite:///university.db
Done.

[('1', 9, 'Fall', 2017)]

### 25. Increase(update) the salary of each instructor by 10% if their current salary is between 0 and 90000.

In [60]:
%%sql
update instructor 
  set salary = salary+(0.1*salary) 
    where salary<90000;

 * sqlite:///university.db
9 rows affected.

[]

by mistake i did'nt put '=' with operation, thus 1 row was not affected, thus added another update command with it.

In [61]:
%%sql
update instructor 
  set salary = salary+(0.1*salary) 
    where salary=90000;

 * sqlite:///university.db
1 rows affected.

[]

In [62]:
%%sql
select name, salary from instructor

 * sqlite:///university.db
Done.

[('Srinivasan', 71500),
 ('Wu', 99000),
 ('Mozart', 44000),
 ('Einstein', 95000),
 ('El Said', 66000),
 ('Gold', 95700),
 ('Katz', 82500),
 ('Califieri', 68200),
 ('Singh', 88000),
 ('Crick', 79200),
 ('Brandt', 92000),
 ('Kim', 88000)]

### 26. Find the names of instructors from Biology department having salary more than 50000.

In [63]:
%%sql
select name, salary from instructor
where dept_name='Biology' and salary>50000;

 * sqlite:///university.db
Done.

[('Crick', 79200)]

### 27. Find the IDs and titles of all courses taken by a student named Shankar.

In [64]:
%%sql
select stu.name, tak.course_id,co.title from student stu
  inner join takes tak on stu.id=tak.id
  inner join course co on tak.course_id=co.course_id
where stu.name='Shankar';

 * sqlite:///university.db
Done.

[('Shankar', 'CS-101', 'Intro. to Computer Science'),
 ('Shankar', 'CS-190', 'Game Design'),
 ('Shankar', 'CS-315', 'Robotics'),
 ('Shankar', 'CS-347', 'Database System Concepts')]

### 28. For each department, find the total credit hours of courses in that department.

In [65]:
%%sql
select course_id,dept_name,sum(credits) as 'total credits' from course
group by dept_name;

 * sqlite:///university.db
Done.

[('BIO-399', 'Biology', 11),
 ('CS-347', 'Comp. Sci.', 17),
 ('EE-181', 'Elec. Eng.', 3),
 ('FIN-201', 'Finance', 3),
 ('HIS-351', 'History', 3),
 ('MU-199', 'Music', 3),
 ('PHY-101', 'Physics', 4)]

### 29. Find the number of courses having A grade in each building.

In [66]:
%%sql
select sec.building, count(tak.course_id) as 'number of courses', tak.grade from takes tak
  inner join section sec on tak.course_id=sec.course_id
where tak.grade='A'
group by sec.building;

 * sqlite:///university.db
Done.

[('Packard', 4, 'A'),
 ('Painter', 1, 'A'),
 ('Taylor', 4, 'A'),
 ('Watson', 2, 'A')]

### 30. Display number of students in each department having total credits divisible by course credits.

In [67]:
%%sql
select student.dept_name, count(student.name) as 'number of students' from student
  inner join course on student.dept_name=course.dept_name
where (student.tot_cred%course.credits)=0
group by student.dept_name;

 * sqlite:///university.db
Done.

[('Biology', 3), ('Comp. Sci.', 8), ('Elec. Eng.', 1), ('Physics', 2)]

### 31. Display number of courses available in each building.

In [68]:
%%sql
SELECT building,count(course_id) as 'number of courses' 
from course,department where department.dept_name=course.dept_name
group by building;

 * sqlite:///university.db
Done.

[('Packard', 1), ('Painter', 2), ('Taylor', 6), ('Watson', 4)]

### 32. Find number of instructors in each department having 'a' and 'e' in their name.

In [69]:
%%sql
select dept_name,count(id) as 'number of instructors'  from instructor
where name like '%e%a%'
group by dept_name;

 * sqlite:///university.db
Done.

[('History', 1)]

### 33. Display number of courses being taught in classroom having capacity more than 20.

In [70]:
%%sql
select sec.room_number,clas.capacity,count(sec.course_id) as 'number of courses'
from section sec
  inner join classroom clas on sec.room_number=clas.room_number
where clas.capacity>20
group by sec.room_number;

 * sqlite:///university.db
Done.

[('100', 30, 2), ('101', 500, 4), ('120', 50, 1), ('3128', 70, 5)]

### 34. Update the budget of each department by Rs. 1000

In [71]:
%%sql
update department
  set budget=budget+1000;

 * sqlite:///university.db
7 rows affected.

[]

In [72]:
%%sql
select * from department;

 * sqlite:///university.db
Done.

[('Biology', 'Watson', 91000),
 ('Comp. Sci.', 'Taylor', 101000),
 ('Elec. Eng.', 'Taylor', 86000),
 ('Finance', 'Painter', 121000),
 ('History', 'Painter', 51000),
 ('Music', 'Packard', 81000),
 ('Physics', 'Watson', 71000)]

### 35. Find number of students in each room.

In [73]:
%%sql
select sec.room_number,count(tak.id) as 'number of students'
from section sec
  inner join takes tak on tak.course_id=sec.course_id
group by sec.room_number;

 * sqlite:///university.db
Done.

[('100', 3), ('101', 16), ('120', 2), ('3128', 9), ('514', 3)]

### 36. Give the prerequisite course for each student.

In [74]:
%%sql
select stu.name, pre.prereq_id from student stu
  left join takes tak on stu.id=tak.id
  inner join prereq pre on tak.course_id=pre.course_id
group by stu.name;

 * sqlite:///university.db
Done.

[('Aoi', 'PHY-101'),
 ('Bourikas', 'CS-101'),
 ('Brown', 'CS-101'),
 ('Levy', 'CS-101'),
 ('Shankar', 'CS-101'),
 ('Tanaka', 'BIO-101'),
 ('Williams', 'CS-101'),
 ('Zhang', 'CS-101')]

### 37. Display number of students attending classes on Wednesday.

In [75]:
%%sql
select ts.day,count(tak.id) as 'number of students'from time_slot ts
  left join section sec on ts.time_slot_id=sec.time_slot_id
  inner join takes tak on tak.course_id=sec.course_id
where ts.day='W'
group by ts.day

 * sqlite:///university.db
Done.

[('W', 24)]

### 38. Display number of students and instructors in each department

In [76]:
%%sql
select stu.dept_name, count(distinct stu.id) as 'number of students',count(distinct ins.id) as 'number of instructors'
from student stu 
  inner join instructor ins on ins.dept_name=stu.dept_name 
group by stu.dept_name;

 * sqlite:///university.db
Done.

[('Biology', 1, 1),
 ('Comp. Sci.', 4, 3),
 ('Elec. Eng.', 2, 1),
 ('Finance', 1, 2),
 ('History', 1, 2),
 ('Music', 1, 1),
 ('Physics', 3, 2)]

### 39. Display number of students in each semester and their sum of credits.

In [77]:
%%sql
select tak.semester, count( tak.id) as 'number of students',sum(stu.tot_cred) as 'sum of credits'
from takes tak
  inner join student stu on stu.id=tak.id
group by tak.semester;

 * sqlite:///university.db
Done.

[('Fall', 9, 580), ('Spring', 11, 654), ('Summer', 2, 240)]

### 40. Give number of instructors in each building.

In [78]:
%%sql
select sec.building, count(tea.id) as 'number of instructors' from section sec
  inner join teaches tea on sec.course_id=tea.course_id
group by sec.building;

 * sqlite:///university.db
Done.

[('Packard', 6), ('Painter', 3), ('Taylor', 8), ('Watson', 4)]

### 41. Display advisor IDs for instructors in Painter building.

In [79]:
%%sql
select adv.i_ID, ins.name,sec.building from section sec
  inner join teaches tea on sec.course_id=tea.course_id
  inner join instructor ins on ins.id=tea.id
  inner join advisor adv on adv.i_ID=tea.id
where sec.building='Painter'
group by sec.building;

 * sqlite:///university.db
Done.

[('76766', 'Crick', 'Painter')]

### 42. Find total credits earned by students coming at 9am.

In [80]:
%%sql
select stu.name, ts.start_hr,stu.tot_cred from student stu
  inner join takes tak on tak.id=stu.id
  inner join section sec on sec.course_id=tak.course_id
  inner join time_slot ts on ts.time_slot_id=sec.time_slot_id
where ts.start_hr=9
group by stu.name;

 * sqlite:///university.db
Done.

[('Brown', 9, 58), ('Chavez', 9, 110), ('Levy', 9, 46), ('Tanaka', 9, 120)]

### 43. Display student names ordered by room number.

In [81]:
%%sql
select stu.name, sec.room_number from student stu
  inner join takes tak on tak.id=stu.id
  inner join section sec on sec.course_id=tak.course_id
order by sec.room_number

 * sqlite:///university.db
Done.

[('Peltier', '100'),
 ('Levy', '100'),
 ('Brown', '100'),
 ('Zhang', '101'),
 ('Zhang', '101'),
 ('Shankar', '101'),
 ('Shankar', '101'),
 ('Chavez', '101'),
 ('Levy', '101'),
 ('Levy', '101'),
 ('Levy', '101'),
 ('Levy', '101'),
 ('Williams', '101'),
 ('Williams', '101'),
 ('Sanchez', '101'),
 ('Brown', '101'),
 ('Brown', '101'),
 ('Bourikas', '101'),
 ('Bourikas', '101'),
 ('Shankar', '120'),
 ('Bourikas', '120'),
 ('Zhang', '3128'),
 ('Shankar', '3128'),
 ('Shankar', '3128'),
 ('Shankar', '3128'),
 ('Levy', '3128'),
 ('Williams', '3128'),
 ('Williams', '3128'),
 ('Brown', '3128'),
 ('Aoi', '3128'),
 ('Brandt', '514'),
 ('Tanaka', '514'),
 ('Tanaka', '514')]

### 44. Find the number of capacity left after occupying all the students.

In [82]:
%%sql
select class.room_number,(class.capacity-count(tak.id)) as 'capacity left'
from classroom class
  inner join section sec on sec.room_number=class.room_number
  inner join takes tak on sec.course_id=tak.course_id
group by sec.room_number;

 * sqlite:///university.db
Done.

[('100', 27), ('101', 484), ('120', 48), ('3128', 61), ('514', 7)]

### 45. Find the duration for which each student has to attend each lecture.

In [83]:
%%sql
select student.name,takes.course_id, end_hr-start_hr as 'duration in hours',end_min-start_min as 'duration in minutes'
from student,takes,section,time_slot
where takes.id=student.id and section.course_id=takes.course_id and time_slot.time_slot_id=section.time_slot_id
group by student.name,takes.course_id;

 * sqlite:///university.db
Done.

[('Aoi', 'EE-181', 0, 50),
 ('Bourikas', 'CS-101', 1, 15),
 ('Bourikas', 'CS-315', 0, 50),
 ('Brandt', 'HIS-351', 0, 50),
 ('Brown', 'CS-101', 1, 15),
 ('Brown', 'CS-319', 0, 50),
 ('Chavez', 'FIN-201', 0, 50),
 ('Levy', 'CS-101', 1, 15),
 ('Levy', 'CS-319', 0, 50),
 ('Peltier', 'PHY-101', 0, 50),
 ('Sanchez', 'MU-199', 0, 50),
 ('Shankar', 'CS-101', 1, 15),
 ('Shankar', 'CS-190', 0, 50),
 ('Shankar', 'CS-315', 0, 50),
 ('Shankar', 'CS-347', 0, 50),
 ('Tanaka', 'BIO-101', 0, 50),
 ('Tanaka', 'BIO-301', 0, 50),
 ('Williams', 'CS-101', 1, 15),
 ('Williams', 'CS-190', 0, 50),
 ('Zhang', 'CS-101', 1, 15),
 ('Zhang', 'CS-347', 0, 50)]

### 46. Create a timetable for the university.

In [168]:
%%sql
SELECT ts.day,sec.building,sec.room_number,sec.course_id 
from section sec,time_slot ts
where ts.time_slot_id=sec.time_slot_id
group by day,room_number;

 * sqlite:///university.db
Done.

[('F', 'Watson', '100', 'PHY-101'),
 ('F', 'Packard', '101', 'MU-199'),
 ('F', 'Watson', '120', 'CS-315'),
 ('F', 'Taylor', '3128', 'EE-181'),
 ('F', 'Painter', '514', 'HIS-351'),
 ('M', 'Watson', '100', 'PHY-101'),
 ('M', 'Packard', '101', 'MU-199'),
 ('M', 'Watson', '120', 'CS-315'),
 ('M', 'Taylor', '3128', 'EE-181'),
 ('M', 'Painter', '514', 'HIS-351'),
 ('R', 'Packard', '101', 'CS-101'),
 ('R', 'Taylor', '3128', 'CS-190'),
 ('T', 'Packard', '101', 'CS-101'),
 ('T', 'Taylor', '3128', 'CS-190'),
 ('W', 'Watson', '100', 'PHY-101'),
 ('W', 'Packard', '101', 'MU-199'),
 ('W', 'Watson', '120', 'CS-315'),
 ('W', 'Taylor', '3128', 'EE-181'),
 ('W', 'Painter', '514', 'HIS-351')]

### 47. Calculate the budget given to each course.

In [159]:
%%sql
select dept.dept_name, co.course_id, (dept.budget/count(co.course_id) ) as 'budget'
from department as dept,course as co
where dept.dept_name=co.dept_name
group by dept.dept_name

 * sqlite:///university.db
Done.

[('Biology', 'BIO-399', 30333),
 ('Comp. Sci.', 'CS-347', 20200),
 ('Elec. Eng.', 'EE-181', 86000),
 ('Finance', 'FIN-201', 121000),
 ('History', 'HIS-351', 51000),
 ('Music', 'MU-199', 81000),
 ('Physics', 'PHY-101', 71000)]

### 48. Find the average salary that's distributed to teachers for each course and sort them in descending order

In [167]:
%%sql
with ins_course as (
  select * from course 
  join teaches on teaches.course_id=course.course_id
  join instructor on instructor.id=teaches.id
  )
select title, avg(salary) from ins_course
group by course_id
order by avg(salary) desc;

 * sqlite:///university.db
Done.

[('Investment Banking', 99000.0),
 ('Physical Principles', 95000.0),
 ('Game Design', 92000.0),
 ('Intro. to Digital Systems', 88000.0),
 ('Image Processing', 87250.0),
 ('Intro. to Biology', 79200.0),
 ('Genetics', 79200.0),
 ('Intro. to Computer Science', 77000.0),
 ('Robotics', 71500.0),
 ('Database System Concepts', 71500.0),
 ('World History', 66000.0),
 ('Music Video Production', 44000.0)]

### 49. Find the average duration of classes for each course id

In [103]:
%%sql
with time_slot_duration as (
  select time_slot_id, end_min-start_min as 'duration' 
  from time_slot)

select course_id,avg(duration) 
from section s join time_slot_duration as tsd
  on tsd.time_slot_id=s.time_slot_id
group by course_id

 * sqlite:///university.db
Done.

[('BIO-101', 50.0),
 ('BIO-301', 50.0),
 ('CS-101', 20.0),
 ('CS-190', 36.0),
 ('CS-315', 50.0),
 ('CS-319', 50.0),
 ('CS-347', 50.0),
 ('EE-181', 50.0),
 ('FIN-201', 50.0),
 ('HIS-351', 50.0),
 ('MU-199', 50.0),
 ('PHY-101', 50.0)]

### 50. Get the name of the instructor with highest salary from each department.

In [88]:
%%sql
select name, dept_name,max(salary) as 'highest salary' from instructor 
group by dept_name

 * sqlite:///university.db
Done.

[('Crick', 'Biology', 79200),
 ('Brandt', 'Comp. Sci.', 92000),
 ('Kim', 'Elec. Eng.', 88000),
 ('Wu', 'Finance', 99000),
 ('Califieri', 'History', 68200),
 ('Mozart', 'Music', 44000),
 ('Gold', 'Physics', 95700)]

### 51. Find out the amount that can be equally distributed to each course in the department from department budget

In [112]:
%%sql
with course_department_data as (
  select * from course join department on course.dept_name=department.dept_name
)
select title,budget/course_count as 'distributed_budget' 
  from course_department_data cdd 
  join ( select dept_name, count(course_id) as course_count from 
    course_department_data 
    group by dept_name) as ddc on cdd.dept_name=ddc.dept_name

 * sqlite:///university.db
Done.

[('Intro. to Biology', 30333),
 ('Genetics', 30333),
 ('Computational Biology', 30333),
 ('Intro. to Computer Science', 20200),
 ('Game Design', 20200),
 ('Robotics', 20200),
 ('Image Processing', 20200),
 ('Database System Concepts', 20200),
 ('Intro. to Digital Systems', 86000),
 ('Investment Banking', 121000),
 ('World History', 51000),
 ('Music Video Production', 81000),
 ('Physical Principles', 71000)]

### 52. Get the sum of the total credits of students that is dealt by the instructors along with their names

In [125]:
%%sql
WITH stu_adv as (
  select * from student 
  join advisor on student.id=advisor.s_ID
)
select i.name,sum_of_credits
from (
  select i_id, sum(tot_cred) as sum_of_credits
  from stu_adv 
  group by i_id) as tot_cred_data 
  join instructor i on i.id=tot_cred_data.i_id

 * sqlite:///university.db
Done.

[('Srinivasan', 32),
 ('Einstein', 102),
 ('Katz', 160),
 ('Singh', 110),
 ('Crick', 120),
 ('Kim', 158)]

### 53. Perform division between student credits and department total credits

In [128]:
%%sql
with dept_cred as( 
  select dept_name,sum(credits) as dept_tot_cred
  from course 
  group by dept_name
)
select s.name,  s.tot_cred/dept_tot_cred 
from student s join dept_cred dc on s.dept_name=dc.dept_name

 * sqlite:///university.db
Done.

[('Zhang', 6),
 ('Shankar', 1),
 ('Brandt', 26),
 ('Chavez', 36),
 ('Peltier', 14),
 ('Levy', 11),
 ('Williams', 3),
 ('Sanchez', 12),
 ('Snow', 0),
 ('Brown', 3),
 ('Aoi', 20),
 ('Bourikas', 32),
 ('Tanaka', 10)]

### 54. If the department budget was to be distributed among the buildings, how much amount can be allocated to each room in a building

In [152]:
%%sql

with build_room as ( 
  select cl.building, count(DISTINCT cl.room_number) as no_of_rooms
  from classroom cl
  join department de on de.building=cl.building
  group by cl.building)
select br.building, sum(de.budget)/no_of_rooms as room_budget
from department de join build_room br on de.building=br.building
group by de.building

 * sqlite:///university.db
Done.

[('Packard', 40500), ('Painter', 86000), ('Taylor', 93500), ('Watson', 81000)]

### 55. Get the name of the building and room number that are occupied during mondays and tuesdays

In [156]:
%%sql
with section_slot as (
  select * from section s
  join time_slot ts on ts.time_slot_id=s.time_slot_id
  join course co on co.course_id=s.course_id
)
select building, room_number, day,time_slot_id,title from section_slot
where day = 'M' or day='T'

 * sqlite:///university.db
Done.

[('Painter', '514', 'M', 'B', 'Intro. to Biology'),
 ('Painter', '514', 'M', 'A', 'Genetics'),
 ('Packard', '101', 'T', 'F', 'Intro. to Computer Science'),
 ('Taylor', '3128', 'T', 'E', 'Game Design'),
 ('Taylor', '3128', 'M', 'A', 'Game Design'),
 ('Watson', '120', 'M', 'D', 'Robotics'),
 ('Watson', '100', 'M', 'B', 'Image Processing'),
 ('Taylor', '3128', 'M', 'C', 'Image Processing'),
 ('Taylor', '3128', 'M', 'A', 'Database System Concepts'),
 ('Taylor', '3128', 'M', 'C', 'Intro. to Digital Systems'),
 ('Packard', '101', 'M', 'B', 'Investment Banking'),
 ('Painter', '514', 'M', 'C', 'World History'),
 ('Packard', '101', 'M', 'D', 'Music Video Production'),
 ('Watson', '100', 'M', 'A', 'Physical Principles')]

<b>Congratulations !! You Have Just completed an assignment!!</b>

![]()

# **FEEDBACK FORM**

https://docs.google.com/forms/d/e/1FAIpQLScnAaAKvph9R3vINyCtOOMiav-tSMsRGlJReMaHyPjsXDlTIA/viewform